# -*- coding: utf-8 -*-
# python3 180222_Q02.py

'''
a의 좌표 (x1, y1)와 b의 좌표 (x2, y2)가 주어지고, a이 계산한 c과의 거리 r1과
b이 계산한 c과의 거리 r2가 주어졌을 때, 류재명이 있을 수 있는 좌표의 수를 출력하는
프로그램을 작성하시오.

입력
첫째 줄에 테스트 케이스의 개수 T가 주어진다. 각 테스트 케이스는 다음과 같이 구성되어있다.
한 줄에 x1, y1, r1, x2, y2, r2가 주어진다.
x1, y1, x2, y2는 -10,000보다 크거나 같고, 10,000보다 작거나 같은 정수이고,
r1, r2는 10,000보다 작거나 같은 자연수이다.


출력
각 테스트 케이스마다 류재명이 있을 수 있는 위치의 수를 출력한다.
만약 c가 있을 수 있는 위치의 개수가 무한대일 경우에는 -1을 출력한다.
'''
ㅋ


# 실수 연산 처리에서 부동소수점 때문에 에러가 날수 있다.
# https://winterj.me/Floating-Point/
